app/Controllers/Auth.php

SELECT *
FROM `utenti`
WHERE `email` = 'marco.rossi@email.com'
 LIMIT 1
---
    public function doLogin()
    {

        $model = new UtentiModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $utente = $model->where('email', $email)->first();