app/Models/AcquistiModel.php

SELECT `biglietti_utenti`.*, `biglietti`.`prezzo`, `tornei`.`nome` as `nomeTorneo`
FROM `biglietti_utenti`
JOIN `biglietti` ON `biglietti`.`id` = `biglietti_utenti`.`biglietto_id`
JOIN `tornei` ON `tornei`.`id` = `biglietti`.`torneo_id`
WHERE `biglietti_utenti`.`utente_id` = '1'
ORDER BY `biglietti_utenti`.`created_at` DESC
---
    public function getAcquistiByUtente($userId)
    {
        return $this->select('biglietti_utenti.*, biglietti.prezzo, tornei.nome as nomeTorneo')
                    ->join('biglietti', 'biglietti.id = biglietti_utenti.biglietto_id')
                    ->join('tornei', 'tornei.id = biglietti.torneo_id')
                    ->where('biglietti_utenti.utente_id', $userId)
                    ->orderBy('biglietti_utenti.created_at', 'DESC')
                    ->findAll();