app/Models/BigliettiModel.php

SELECT `biglietti`.*, `tornei`.`nome` as `nomeTorneo`
FROM `biglietti`
JOIN `tornei` ON `tornei`.`id` = `biglietti`.`torneo_id`
---
    public function getBigliettiConTorneo()
    {
        $builder = $this->db->table($this->table);
        $builder->select('biglietti.*, tornei.nome as nomeTorneo, tornei.data_inizio, tornei.data_fine');
        $builder->join('tornei', 'tornei.id = biglietti.torneo_id');
        // Visualizza solo i tornei che non sono ancora iniziati
        $builder->where('tornei.data_inizio >', date('Y-m-d'));
        // Ordina per data_inizio in ordine ascendente
        $builder->orderBy('tornei.data_inizio', 'ASC');
        $query = $builder->get();

SELECT *
FROM `biglietti`
WHERE `biglietti`.`id` = '2'
UPDATE `biglietti` SET `disponibilita` = 2999
WHERE `biglietti`.`id` IN ('2')
---
    public function decrementaDisponibilita($bigliettoId, $quantita)
    {
        $biglietto = $this->find($bigliettoId);
        if (!$biglietto) {
            return false;
        }
        $nuovaDisponibilita = $biglietto['disponibilita'] - $quantita;
        if ($nuovaDisponibilita < 0) {
            $nuovaDisponibilita = 0;
        }
        $this->update($bigliettoId, ['disponibilita' => $nuovaDisponibilita]);