app/Models/RankingModel.php

    public function getClassifica()
    {
        return $this->db->table('ranking')
            ->select('ranking.posizione, ranking.punti, giocatori.nome, giocatori.cognome, giocatori.nazione')
            ->join('giocatori', 'ranking.giocatore_id = giocatori.id')
            ->orderBy('ranking.posizione', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `ranking`.`posizione`, `ranking`.`punti`, `giocatori`.`nome`, `giocatori`.`cognome`, `giocatori`.`nazione`
FROM `ranking`
JOIN `giocatori` ON `ranking`.`giocatore_id` = `giocatori`.`id`
ORDER BY `ranking`.`posizione` ASC